NDJSec/FALCON/knowledge_base/svd/data/Freescale/MKV56F20.svd
        <register>
          <name>MCTRL0</name>
          <description>Master Control Register 0</description>
          <addressOffset>0x188</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>LDOK</name>
              <description>Load Okay</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Do not load new values.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Load prescaler, modulus, and PWM values of the corresponding submodule.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLDOK</name>
              <description>Clear Load Okay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RUN</name>
              <description>Run</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PWM generator is disabled in the corresponding submodule.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PWM generator is enabled in the corresponding submodule.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPOL</name>
              <description>Current Polarity</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PWM23 is used to generate complementary PWM pair in the corresponding submodule.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PWM45 is used to generate complementary PWM pair in the corresponding submodule.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL1</name>
          <description>Master Control Register 1</description>
          <addressOffset>0x18A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>MONPLL</name>
              <description>Monitor PLL State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Not locked. Do not monitor PLL operation. Resetting of the fractional delay block in case of PLL losing lock will be controlled by software.</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Not locked. Monitor PLL operation to automatically disable the fractional delay block when the PLL encounters problems.</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Locked. Do not monitor PLL operation. Resetting of the fractional delay block in case of PLL losing lock will be controlled by software. These bits are write protected until the next reset.</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Locked. Monitor PLL operation to automatically disable the fractional delay block when the PLL encounters problems. These bits are write protected until the next reset.</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRL</name>
          <description>Fault Control Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FIE</name>
              <description>Fault Interrupt Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>FAULTx CPU interrupt requests disabled.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>FAULTx CPU interrupt requests enabled.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSAFE</name>
              <description>Fault Safety Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Normal mode. PWM outputs disabled by this fault are not enabled until FSTS[FFLAGx] is clear at the start of a half cycle or full cycle depending on the state of FSTS[FFULL] without regard to the state of FSTS[FFPINx]. The PWM outputs disabled by this fault input will not be re-enabled until the actual FAULTx input signal de-asserts since the fault input will combinationally disable the PWM outputs (as programmed in DISMAPn).</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Safe mode. PWM outputs disabled by this fault are not enabled until FSTS[FFLAGx] is clear and FSTS[FFPINx] is clear at the start of a half cycle or full cycle depending on the state of FSTS[FFULL].</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAUTO</name>
              <description>Automatic Fault Clearing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Manual fault clearing. PWM outputs disabled by this fault are not enabled until FSTS[FFLAGx] is clear at the start of a half cycle or full cycle depending the state of FSTS[FFULL]. This is further controlled by FCTRL[FSAFE].</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Automatic fault clearing. PWM outputs disabled by this fault are enabled when FSTS[FFPINx] is clear at the start of a half cycle or full cycle depending on the state of FSTS[FFULL] without regard to the state of FSTS[FFLAGx].</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLVL</name>
              <description>Fault Level</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A logic 0 on the fault input indicates a fault condition.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A logic 1 on the fault input indicates a fault condition.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSTS</name>
          <description>Fault Status Register</description>
          <addressOffset>0x18E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FFLAG</name>
              <description>Fault Flags</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No fault on the FAULTx pin.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Fault on the FAULTx pin.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFULL</name>
              <description>Full Cycle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PWM outputs are not re-enabled at the start of a full cycle</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PWM outputs are re-enabled at the start of a full cycle</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FFPIN</name>
              <description>Filtered Fault Pins</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FHALF</name>
              <description>Half Cycle Fault Recovery</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>PWM outputs are not re-enabled at the start of a half cycle.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PWM outputs are re-enabled at the start of a half cycle (as defined by VAL0).</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FFILT</name>
          <description>Fault Filter Register</description>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FILT_PER</name>
              <description>Fault Filter Period</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILT_CNT</name>
              <description>Fault Filter Count</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GSTR</name>
              <description>Fault Glitch Stretch Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Fault input glitch stretching is disabled.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Input fault signals will be stretched to at least 2 IPBus clock cycles.</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FTST</name>
          <description>Fault Test Register</description>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>FTEST</name>
              <description>Fault Test</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>No fault</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Cause a simulated fault</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FCTRL2</name>
          <description>Fault Control 2 Register</description>
          <addressOffset>0x194</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>NOCOMB</name>
              <description>No Combinational Path From Fault Input To PWM Output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>There is a combinational link from the fault inputs to the PWM outputs. The fault inputs are combined with the filtered and latched fault signals to disable the PWM outputs.</description>
                  <value>#0000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>The direct combinational path from the fault inputs to the PWM outputs is disabled and the filtered and latched fault signals are used to disable the PWM outputs.</description>
                  <value>#0001</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
